src/InformationRegisters/InfoBaseObjectMaps.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>InfoBaseObjectMaps</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>SourceUUIDString</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ObjectExportedByRef</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>InfoBaseNode</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SourceUUID</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>TargetUUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>TargetType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SourceType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/InfoBaseObjectMaps/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// INTERNAL PROCEDURES AND FUNCTIONS

// Adds the record to the register by the passed structure values.
Procedure AddRecord(RecordStructure, Import = False) Export
	
	DataExchangeServer.AddRecordToInformationRegister(RecordStructure, "InfoBaseObjectMaps", Import);
	
EndProcedure

// Deletes the record set from the register by the passed structure values.
Procedure DeleteRecord(RecordStructure, Import = False) Export
	
	DataExchangeServer.DeleteRecordSetFromInformationRegister(RecordStructure, "InfoBaseObjectMaps", Import);
	
EndProcedure

Function ObjectIsInRegister(Object, InfoBaseNode) Export
	
	QueryText = "
	|SELECT 1
	|FROM
	|	InformationRegister.InfoBaseObjectMaps AS InfoBaseObjectMaps
	|WHERE
	|	  InfoBaseObjectMaps.InfoBaseNode = &InfoBaseNode
	|	AND InfoBaseObjectMaps.SourceUUID = &SourceUUID
	|";
	
	Query = New Query;
	Query.SetParameter("InfoBaseNode", InfoBaseNode);
	Query.SetParameter("SourceUUID",   Object);
	Query.Text = QueryText;
	
	Return Not Query.Execute().IsEmpty();
EndFunction

Procedure DeleteObsoleteUnloadByRefModeRecords(InfoBaseNode) Export
	
	QueryText = "
	|//////////////////////////////////////////////////////////{InfoBaseObjectMapsByRef}
	|SELECT
	|	InfoBaseObjectMaps.InfoBaseNode,
	|	InfoBaseObjectMaps.SourceUUID,
	|	InfoBaseObjectMaps.TargetUUID,
	|	InfoBaseObjectMaps.TargetType,
	|	InfoBaseObjectMaps.SourceType
	|INTO InfoBaseObjectMapsByRef
	|FROM
	|	InformationRegister.InfoBaseObjectMaps AS InfoBaseObjectMaps
	|WHERE
	|	  InfoBaseObjectMaps.InfoBaseNode = &InfoBaseNode
	|	AND InfoBaseObjectMaps.ObjectExportedByRef
	|;
	|
	|//////////////////////////////////////////////////////////{}
	|SELECT DISTINCT
	|	InfoBaseObjectMapsByRef.InfoBaseNode,
	|	InfoBaseObjectMapsByRef.SourceUUID,
	|	InfoBaseObjectMapsByRef.TargetUUID,
	|	InfoBaseObjectMapsByRef.TargetType,
	|	InfoBaseObjectMapsByRef.SourceType
	|FROM
	|	InfoBaseObjectMapsByRef AS InfoBaseObjectMapsByRef
	|LEFT JOIN InformationRegister.InfoBaseObjectMaps AS InfoBaseObjectMaps
	|ON InfoBaseObjectMaps.SourceUUID = InfoBaseObjectMapsByRef.SourceUUID
	|	AND InfoBaseObjectMaps.ObjectExportedByRef = False
	|	AND InfoBaseObjectMaps.InfoBaseNode = &InfoBaseNode
	|WHERE
	|	NOT InfoBaseObjectMaps.InfoBaseNode IS NULL
	|";
	
	Query = New Query;
	Query.SetParameter("InfoBaseNode", InfoBaseNode);
	Query.Text = QueryText;
	
	Result = Query.Execute();
	
	If Not Result.IsEmpty() Then
		
		Selection = Result.Choose();
		
		While Selection.Next() Do
			
			RecordStructure = New Structure("InfoBaseNode, SourceUUID, TargetUUID, TargetType, SourceType");
			
			FillPropertyValues(RecordStructure, Selection);
			
			DeleteRecord(RecordStructure, True);
			
		EndDo;
		
	EndIf;
	
EndProcedure
